Rechnerubung/Week6/turbulent_channel/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
type            sets;

libs            ("libsampling.so");

writeControl    writeTime;
interpolationScheme cellPoint;
setFormat       raw;



sets
(
    x_by_H_01
    {
        type    lineUniform;
        axis    y;
        start   (0.1 0   0);
        end     (0.1 0.2 0);
        nPoints 200;
    }

     x_by_H_05
    {
        type    lineUniform;
        axis    y;
        start   (0.5 0   0);
        end     (0.5 0.2 0);
        nPoints 200;
    }
    x_by_H_09
    {
        type    lineUniform;
        axis    y;
        start   (0.9 0   0);
        end     (0.9 0.2 0);
        nPoints 200;
    }
    
);

fields          (U);
// ************************************************************************* //
